[
  {
    "country": "France",
    "location_1": "Eiffel Tower",
    "rating_1": "4.7",
    "num_reviews_1": "430,108",
    "top_review_1": "I visited the Eiffel Tower over the weekend and had an amazing experience. The views were absolutely breathtaking, and the monument itself is a stunning piece of history and art. Purchasing tickets in advance was a smart move—there were hardly any lines at security. As soon as I passed through, I found myself in a charming garden setting. I also enjoyed some delicious snacks and a great beer, which made the visit even more memorable. Highly recommend!",
    "location_2": "Arc de Triomphe",
    "rating_2": "4.7",
    "num_reviews_2": "261,803",
    "top_review_2": "The Arc de Triomphe is an iconic monument, just as famous as the Eiffel Tower, and a sight you simply can’t miss—even if you’re just passing through Paris. Steeped in history, this landmark stands at the heart of a bustling roundabout, making it a striking focal point of the city. If time allows, take the underground tunnel to safely reach the monument without navigating traffic. For an unforgettable experience, climb to the top and enjoy breathtaking, one-of-a-kind views of Paris. No matter where you stand, every angle offers a perfect photo opportunity—just be mindful of your surroundings, as this area is always busy.",
    "location_3": "Promenade Jean-Paul Belmondo",
    "rating_3": "4.9",
    "num_reviews_3": "25",
    "top_review_3": "Beautiful place. Love the views. You have a beautiful view of the old city, and another beautiful view of the newer buildings in Paris. You'll find a lot of people taking wedding pictures here or simply photo sessions. Although this is a bridge, the place is so romantic and beautiful. With all these views and monuments around, it makes it the perfect place to be.",
    "location_4": "Louvre Museum",
    "rating_4": "4.7",
    "num_reviews_4": "338,825",
    "top_review_4": "The Louvre is an obvious choice when you visit Paris.  My suggestion for the best time without tons of people is to visit in the off season, like February.  It's cold and sometimes dreary outside but not inside!  Get there early so you can spend all day there.  Take your time to browse.  Stop and have lunch at Angelina's to recharge.  Do your research before you go.  What do you want to see and where EXACTLY is it.  The provided map is ok but there are so many amazing things to see it helps if you plan.  Or, don't.  Just wander and get lost.  If you happen to go during the couture exhibition go!!  It's amazing!",
    "location_5": "Palace of Versailles",
    "rating_5": "4.6",
    "num_reviews_5": "150,928",
    "top_review_5": "Simply stunning, mesmerising palace, didn't expect to see so much so well worth the ticket price. The murals and 3D like painting are so well preserved as if it was painted yesterday. Really a mind blowing experience. Seeing each room for different activities, the beautiful decor, golden furniture, the king and queens bedroom. Just amazing! Of course the cherry on the cake was standing in the world famous Hall of Mirrors. Breathtaking experience and even so special getting to visit on my birthday"
  },
  {
    "country": "Spain",
    "location_1": "Plaza Mayor",
    "rating_1": "4.6",
    "num_reviews_1": "187,620",
    "top_review_1": "Such a sight to behold. I wandered here because of Somebody Feed Phil and my co worker told me I needed to see it as well. Somehow I kept walking right past it, and I legit had to use Google maps to find one of the entrances. And when I did, I wasn’t disappointed. Such a great spot to visit in the city and to sit at and relax.",
    "location_2": "Park Güell",
    "rating_2": "4.4",
    "num_reviews_2": "210,274",
    "top_review_2": "It’s a beautiful walk.  You could smell the wisteria.  The views are breathtaking.  The time they put in by keeping the grounds beautiful and restoring the park speaks volumes to how breathtaking the entire park is.  The mosaics art throughout the park is always enjoyed by all.  It’s a definite must see for any age.",
    "location_3": "Basílica de la Sagrada Família",
    "rating_3": "4.8",
    "num_reviews_3": "281,770",
    "top_review_3": "This incredible monument evokes a sense of wonder and awe.  Its intricate details captivate the eye, drawing you in to explore its rich artistry. The sheer scale of the structure is breathtaking, leaving a lasting impression on all who visit.   It's a testament to human creativity and ingenuity. Visiting this landmark is an unforgettable experience, enriching one's appreciation for art and history.  It's a true masterpiece that deserves recognition and admiration. I recommend booking tickets in advance or you will spend a lot of time waiting or even not getting in.",
    "location_4": "Alhambra",
    "rating_4": "4.8",
    "num_reviews_4": "144,784",
    "top_review_4": "We had a tour guide and let me tell you it was worth every single cent! you should definitely buy tickets in advance( maybe 2-3 months earlier). There were beautiful gardens and breathtaking castles, all of which held a lot of  history! Very happy with my visit, would recommend to everyone! IT IS A MUST!",
    "location_5": "Royal Palace of Madrid",
    "rating_5": "4.7",
    "num_reviews_5": "115,427",
    "top_review_5": "Reserve ahead of time so you can skip the long lines. This is one of the most beautiful palaces in Europe. Guides are amazing, I usually don't like guided tours, but our guide loved her job and was very knowledgeable and passionate about Spanish history. She kept the entire group engaged and interested."
  },
  {
    "country": "United States",
    "location_1": "Empire State Building",
    "rating_1": "4.7",
    "num_reviews_1": "114,186",
    "top_review_1": "One of the most iconic buildings in the world and a symbol of the Empire State with some of the most outstanding views of New York City. As you travel up the Empire State building has great exhibits highlighting the history and cultural importance of this incredible building. On reaching the top you are treated with some of the most beautiful views of New York City out there. The staff are incredibly kind, knowledgeable, and inviting and provide a great atmosphere with their classic outfits. From ever-changing colors to shimmering on the hour every hour, it is one of the places that can't be missed when visiting New York City.",
    "location_2": "Great Smoky Mountains National Park",
    "rating_2": "4.9",
    "num_reviews_2": "49,016",
    "top_review_2": "This is a great national park. It's also one of the only free ones to enter. There is great wildlife here, mostly elk, and there are lots of parks with nice brooks. It's a long, scenic drive, and it will bring you from Gatlinburg, TN, to Cherokee, NC. It's absolutely beautiful. I would recommend going to Laurel Falls. It's a long walk from parking, but the scenery is amazing. I would definitely visit this park another time, it's stunning and beautiful!",
    "location_3": "Grand Canyon National Park",
    "rating_3": "4.8",
    "num_reviews_3": "61,080",
    "top_review_3": "Absolutely stunning!  I knew it was going to be big but nothing can prepare you for the actual visuals.  The park is organized and has plenty of pull offs on the scenic drive.  Definitely one of those parks where you could spend days exploring.  We will be back!",
    "location_4": "Central Park",
    "rating_4": "4.8",
    "num_reviews_4": "280,202",
    "top_review_4": "A super fun place to walk around while visiting new york. The park is super clean and has a bunch of fun landmarks to check out. We went on a rainy day and even though our jackets were drenched, we still had a blast. The park is very big and you can probably walk the whole thing in about a couple hours. We only did half and it took an hour.",
    "location_5": "Niagara Falls",
    "rating_5": "4.8",
    "num_reviews_5": "126,368",
    "top_review_5": "Niagara Falls is definitely someplace you need to see at least once in your life. We visited the NY side a few years ago and we were able to catch the light shows at night which were pretty cool. It’s definitely a beautiful place to visit !"
  },
  {
    "country": "China",
    "location_1": "Temple of Heaven",
    "rating_1": "4.6",
    "num_reviews_1": "2,489",
    "top_review_1": "Visiting the temple was a truly fascinating experience. The site, historically significant as the place where the emperor—believed to be the 'Son of Heaven'—would pray for favorable weather and a bountiful harvest, offers a deep connection to China's rich heritage. What made our tour even more special was seeing people, from mother-daughter pairs to couples and solo visitors, dressed in traditional Chinese costumes. The intricate embroidery and vibrant, lively colors of these garments brought the culture to life in such a beautiful way. It’s an incredibly fun and immersive way to experience Chinese traditions while also learning about their history. Highly recommend this for anyone looking to dive deeper into the local culture!",
    "location_2": "Great Wall of China",
    "rating_2": "4.3",
    "num_reviews_2": "18,330",
    "top_review_2": "A 7-world-wonder! Really beautiful. Went with a big group on a trip to China and this was worth the stop. Amazing views and great memories. Loved the people we met and had a wonderful experience.",
    "location_3": "Summer Palace",
    "rating_3": "4.6",
    "num_reviews_3": "8,551",
    "top_review_3": "A stunning UNESCO World Heritage Site that reflects the grandeur of China, this location spans vast grounds featuring picturesque lakes, traditional pavilions, and intricately designed bridges. It offers a serene retreat from the bustling city. The views from Longevity Hill and Kunming Lake are breathtaking, especially during sunrise or sunset. Strolling through the elaborately crafted pathways and exploring iconic landmarks like the Marble Boat and the Seventeen-Arch Bridge feels like stepping back in time. It’s a must-visit destination for anyone seeking to experience history, culture, and natural beauty in Beijing.",
    "location_4": "The Bund",
    "rating_4": "4.7",
    "num_reviews_4": "5,798",
    "top_review_4": "Great landmark and shows heart of Shanghai. Amazing experience to be in the center of historical buildings and great view of modern skycrapers including the iconic TV Tower of Shanghai. Unforgettable experience",
    "location_5": "The Palace Museum",
    "rating_5": "4.6",
    "num_reviews_5": "16,012",
    "top_review_5": "This is something incredible! The world biggest historical place. The UNESCO heritage. We spent there 4 hours but for sure it wasn’t enough. Huge territory. Amazing palaces. Beautiful exhibitions. Over 700000 sq meters. So if you want to see every corner of this place you definitely have to spend the whole day. Be ready to present your ID for every ticket you will buy. The general admission is 10 yuan and museum entrance also 10 yuan each. Thousands of people everywhere. Very clean place."
  },
  {
    "country": "Italy",
    "location_1": "Amalfi Coast",
    "rating_1": "4.7",
    "num_reviews_1": "83,188",
    "top_review_1": "Wonderful place to visit. I drove this place and a spent a night here. The drive definitely has a lot of beautiful lookout places. If you are at that part of Italy, rent a car and drive in that highway (questionable if you can call it a highway), it won’t disappoint you. But driving in that road is not for a faint of heart.",
    "location_2": "Trevi Fountain",
    "rating_2": "4.7",
    "num_reviews_2": "453,623",
    "top_review_2": "Crowded but still accessible. A bit of a wait if you want to be right down at the fountain's edge for closer pics or to throw coins over your left shoulder with your right hand to insure your return to this magical city, but worth it. A beautiful piece of art no matter how many folks are crowded around it!",
    "location_3": "Tower of Pisa",
    "rating_3": "4.7",
    "num_reviews_3": "169,031",
    "top_review_3": "An iconic landmark you must see! The Leaning Tower of Pisa is one of the most famous landmarks in the world, and it’s definitely worth a visit. The surroundings are beautiful, with historic buildings and a charming atmosphere. Climbing to the top offers a stunning view of the city and is a unique experience. I recommend visiting early in the morning or later in the afternoon to avoid the crowds. And don’t forget to take the classic “holding up the tower” photo!",
    "location_4": "Roman Forum",
    "rating_4": "4.7",
    "num_reviews_4": "134,208",
    "top_review_4": "Exploring the history of Rome here is amazing to see.  You can only see part of it from the main street, and it's 100 times better to explore it yourself or with a guide.  It's truly amazing that these buildings still exist and the history here just leaves you amazed!",
    "location_5": "Colosseum",
    "rating_5": "4.7",
    "num_reviews_5": "436,783",
    "top_review_5": "you can see why it’s considered a wonder if the ancient world- it’s just pretty incredible!! the history behind it shaped today’s society and that’s so impressive. we bought tickets in advance so went walked straight to security and we were in!! you get to go up to level 2 with the basic ticket and down to the ground floor too. the gift shop was crowded but very cute. wonderful to see. definitely worth looking at it at night, there are hardly any people and the illuminations are so cool!!"
  },
  {
    "country": "Turkey",
    "location_1": "Topkapi Palace Museum",
    "rating_1": "4.6",
    "num_reviews_1": "104,755",
    "top_review_1": "Absolutely fantastic! If you like world history, this is the place.  If you like looking at historic tile and architecture, this is your place.  The grounds are beautiful and everything is very well maintained.  You can't go wrong here.",
    "location_2": "Hagia Sophia Grand Mosque",
    "rating_2": "4.8",
    "num_reviews_2": "133,429",
    "top_review_2": "Absolutely stunning mosque. We visited the big three while in Istanbul and this was certainly our favourite by a good way. Amazing history, I'd recommend getting the museum ticket too, which was fabulous for all ages. Go to the museum first to find out the amazing history and then in to the Hagia Sophia.",
    "location_3": "The Blue Mosque",
    "rating_3": "4.7",
    "num_reviews_3": "104,480",
    "top_review_3": "Amazing architecture and design. A great piece of intelligence architecture of that time. The art on the walls and roof is amazing and one of its kind. Definitely worth a visit and know the history before you visit, it will be a plus. Also, please respect the place and follow the instructions before entering. Overall a good experience to visit a great place of architecture.",
    "location_4": "Basilica Cistern",
    "rating_4": "4.6",
    "num_reviews_4": "80,155",
    "top_review_4": "Fantastic place! Huge, for a construction underground from two thousand years ago, impressive as decorative art, a history lesson. The Turks learned of its existence a hundred years after they conquered Constantinople! Supported by a lot of columns, most of them simple, but also some beautiful, decorated, recovered from old demolished Roman temples. A place to see absolutely and at leisure.",
    "location_5": "Galata Tower",
    "rating_5": "4.6",
    "num_reviews_5": "185,636",
    "top_review_5": "Such a cute place to take photos! We didn't have time to visit inside the tower, just took photos on the street. If we had more time, we definitely would have visited the inside of the tower."
  },
  {
    "country": "Mexico",
    "location_1": "Tulum",
    "rating_1": "4.7",
    "num_reviews_1": "67,520",
    "top_review_1": "Amazing ruins with a unique atmosphere! Plenty of iguanas roaming around, especially on top of the structures, adding to the experience. The most breathtaking view is the coastline overlooking the Temple of the Wind—absolutely stunning. It wasn’t overly crowded during my visit, making it even more enjoyable. Definitely a must-see while in Quintana Roo!",
    "location_2": "Xcaret Park",
    "rating_2": "4.8",
    "num_reviews_2": "110,886",
    "top_review_2": "Excellent park for a full day experience including the night show. The park offers several fun activities in the water including snorkeling, beach and river. Learning about Maya Region animals and nature was great. Food buffet was on point. Having access to lockers and showers was great and convenient.",
    "location_3": "The Arch of Cabo San Lucas",
    "rating_3": "4.9",
    "num_reviews_3": "13,152",
    "top_review_3": "We took a cruise pass this area and it was amazing. The pics and videos don’t do its justice. You just have to be there to experience the scene. We’d love to anchor in to the beach behind it but our cruise didn’t include it. There were many other cruises in the area enjoying the views too.",
    "location_4": "Mexico City Metropolitan Cathedral",
    "rating_4": "4.7",
    "num_reviews_4": "21,626",
    "top_review_4": "I was completely blown away by how extravagant and unique place was. It gave me flashbacks to traveling Italy and seeing all of the cathedrals. This cathedral is second to none in North America. I would highly recommend visiting. The organ itself is worth going to see it is stunning. The tall ceilings craft artwork, and the time that was dedicated to put this church together is immeasurable.",
    "location_5": "Templo Mayor Museum",
    "rating_5": "4.8",
    "num_reviews_5": "32,798",
    "top_review_5": "Life changing experience. WOW. We spent so much time soaking in the ruins and then the amazing, extensive, wonderful, beautifully thought out museum just blew our minds. So many artifacts, the story of the excavation richly and dramatically illustrated. A true gem of a museum. After hours we couldn't even take in more information and just want to return. Incredible to see the 700 years of history in contrast to each other, the ancient, the old, the antique, the modern, and people flowing all over. True river of time. Beautiful excavation and presentation, a must visit in CDMX!"
  },
  {
    "country": "Thailand",
    "location_1": "Erawan National Park",
    "rating_1": "4.6",
    "num_reviews_1": "14,225",
    "top_review_1": "Amazing place, loved trekking here. The water is cold which feels amazing in the scorching sun.It is definitely a must-visit for nature lovers and adventure seekers. The 7-tier waterfall of just 2000m makes for a fun and manageable trek, and the cool, clear water is a perfect reward after the hike to the top. But, nothing beats a refreshing dip in those emerald like pools on a hot summer day. The well-maintained & nicely laid out paths and stairs also make it accessible for most people, though the higher levels can still be a bit of a challenge for some.",
    "location_2": "The Grand Palace",
    "rating_2": "4.6",
    "num_reviews_2": "68,215",
    "top_review_2": "An spectacular palace. Please do not listen to the people outside of the palace telling you it is closed. It is always open until 3.30pm. Is necessary to have your knees and shoulders covered men or women. They sell pants outside if you do not have one. Go into the emerald buddah temple as it is impressive (no additional cost). There are bathrooms near the entrance so I recommend using it before or after entering as you have to walk out if you need to go",
    "location_3": "Khao Sok National Park",
    "rating_3": "4.7",
    "num_reviews_3": "7,417",
    "top_review_3": "Visited for the day and absolutely loved it. Pictures don’t do it how beautiful it is! It’s a must if you’re in Thailand. We scootered 2hrs from Ao Nang and 2hrs back and it was 1000% worth the trip. Even spider man comes round with coconut ice cream and wow stunning",
    "location_4": "Phimai Historical Park",
    "rating_4": "4.6",
    "num_reviews_4": "7,664",
    "top_review_4": "Lovely Khmer style temple that is very similar to Angkor Wat. 100thb entry fee for foreigners. We went in the morning around 9:30am. And there was already people leaving then some local school groups caught up to us as well. The sun was hotter too after 10pm so I recommend to visit earlier if you can.",
    "location_5": "Bang Pa-In Palace",
    "rating_5": "4.5",
    "num_reviews_5": "6,835",
    "top_review_5": "A sprawling summer palace. Start early so that it doesn’t get ok sunny to walk around the place. Different building and buildings are built in different styles varying from Chinese, Thai to European styles. One can only peep in one or two of the interiors. It’s an enjoyable walk. Take the golf cart only if you are short on time. Dress appropriately, covered shoulders and length below the knees. If you enjoy art and culture it worth a visit."
  },
  {
    "country": "Japan",
    "location_1": "Fushimi Inari Taisha",
    "rating_1": "4.6",
    "num_reviews_1": "76,159",
    "top_review_1": "It’s definitely a worthwhile experience, especially if you hike all the way to the top of the mountain. That’s when you truly immerse yourself in the experience, connect with nature, and feel the meditative atmosphere and purpose of the shrine. If you don’t go all the way up, you end up stuck in the more touristy area, crowded with people, making it harder to connect. The hike is a bit challenging, taking around 40 minutes to 1.5 hours, but it’s absolutely worth it for the full experience. On the way back, I even stopped halfway at a viewpoint, lay down on the rocks soaking up the sun for about 40 minutes, and it was amazing—I almost took a nap.",
    "location_2": "Kinkaku-ji",
    "rating_2": "4.5",
    "num_reviews_2": "57,948",
    "top_review_2": "What a picturesque Golden Pagoda set amidst and surrounded by an emerald green lake. It is a very popular venue for locals and tourists alike and gets very very crowded during the day. To avoid the tour buses, it's best to be there as soon as the gates open",
    "location_3": "Dotonbori",
    "rating_3": "4.4",
    "num_reviews_3": "74,393",
    "top_review_3": "Bustling area filled with shops and street food options. Popular places such as Rikuro's cheesecake and Glico sign are in this area. Considered as a must visit by Tourists so crowded all the time. The Ferris wheel in the Don Quijote is an interesting activity. Limited options for vegan/vegetarian food.",
    "location_4": "Tokyo Tower",
    "rating_4": "4.5",
    "num_reviews_4": "83,175",
    "top_review_4": "Really enjoyed our Tokyo Tower experience. It’s not as tall as others like the SkyTree but taller isn’t always better. You still get some amazing views here and we only went to the main deck. Timed the visit to watch the sunset and on perfect evening and it was wonderful. Wasn’t too crowded either although people do camp out/ hog window and space at sunset so have to consider getting their early of this is your aim. Also make sure you take the stairs back down! Not many people do it but if you are healthy or don’t mind steps I absolutely recommend it for a different and unique perspective of the tower and views. Very reasonably priced attraction.",
    "location_5": "Higashiyama Jisho-ji",
    "rating_5": "4.5",
    "num_reviews_5": "14,935",
    "top_review_5": "Amazing temple with a Japanese zen garden. We came just as the cherry blossoms were blooming. This temple is next to the philosophers path so it was very convenient to stop by for a visit. For 500 yen, it was worth it to escape the busy city life and enjoy the calm scenery of the garden. I would highly recommend giving this place a visit if you want to have a slower paced day."
  },
  {
    "country": "United Kingdom",
    "location_1": "Stonehenge",
    "rating_1": "4.5",
    "num_reviews_1": "58,051",
    "top_review_1": "I visited Stonehenge and really liked the experience. The big stones are very old and it’s surprising how people managed to put them there so many years ago. The place feels very calm and has a special energy. There is good information to learn about the history and why it is important. The area is clean and the view around is also very nice. A good place to visit if you like history and nature.",
    "location_2": "Tower of London",
    "rating_2": "4.7",
    "num_reviews_2": "111,322",
    "top_review_2": "An amazing experience! The tour was well-organized, and our guide was fantastic—very funny and engaging while sharing the rich history of the city. It made the whole experience both educational and entertaining. The sights were absolutely beautiful, and we got to appreciate London in a whole new way. Highly recommended for anyone wanting to explore the city's history with a fun and knowledgeable guide!",
    "location_3": "Buckingham Palace",
    "rating_3": "4.5",
    "num_reviews_3": "180,060",
    "top_review_3": "Was actually really nice! A lieutenant was saluting the King when we visited so it was extremely busy but managed to hear the Royal Band play a few cover songs!! The area surrounding it is very pretty also.",
    "location_4": "Bath Skyline",
    "rating_4": "4.7",
    "num_reviews_4": "762",
    "top_review_4": "Imagine: warm coffee in hand, the sun setting over Bath, painting the cityscape in golden hues. You're nestled on soft, fresh grass, a clear sky above. And if that wasn't perfect enough, friendly dogs and puppies wander by, offering delightful, unexpected kisses. It's a truly idyllic escape.",
    "location_5": "Pulteney Bridge",
    "rating_5": "4.6",
    "num_reviews_5": "8,850",
    "top_review_5": "Worth a visit, especially as it’s part of a UNESCO World Heritage Site. Its unique architecture - taking inspiration from the bridges of Florence and Venice - makes it both functional and visually striking. Stretching over the River Avon, the design draws plenty of tourists and photographers. It’s a lovely spot to pause, snap a photo, and take in the view. While there isn’t a lot immediately around the bridge itself, a short walk will lead you to a spacious grassy area - perfect for relaxing and soaking up the weather, if you’re lucky enough to catch a sunny day like I did."
  },
  {
    "country": "Austria",
    "location_1": "Hofburg",
    "rating_1": "4.7",
    "num_reviews_1": "51,980",
    "top_review_1": "Absolutely beautiful library. It's definitely worth the admission fee, even for just a short stop. The only drawback is the placement of modern plaques and light bars.",
    "location_2": "Schönbrunn Palace",
    "rating_2": "4.7",
    "num_reviews_2": "161,261",
    "top_review_2": "We had the most incredible experience at the palace. I strongly advise everyone to visit the palace when in Vienna. The attention to detail, organization, was impeccable. We loved the free audio guide - it was super informative and provided in many languages. The palace is beautiful inside. Such a good experience.",
    "location_3": "Golden Roof",
    "rating_3": "4.4",
    "num_reviews_3": "20,422",
    "top_review_3": "Beautiful centre of Innsbruck with a lot of history. Been there many times. Take a break - take a coffee:) or just go to river bank to observe the city landscape.",
    "location_4": "Krimml Waterfalls",
    "rating_4": "4.8",
    "num_reviews_4": "14,715",
    "top_review_4": "I see it again the great pictures and videos in my gallery. Great experience, the climb is not easy but the view is definitely worth it. Recommended, take a bottle of water with you! I hesitated to go but I really do not regret it!",
    "location_5": "Schloss Ambras Innsbruck",
    "rating_5": "4.5",
    "num_reviews_5": "7,610",
    "top_review_5": "Cool castle surrounded by a beautiful park. The man who made it was also a huge collector of art, armor, weapons, etc, which are all on display within the castle, which is also the only part of the complex you need to buy a ticket for. Both the outside and the inside of the castle are really beautiful and well preserved. the park/forest around the castle has some beautiful rock formations and waterfalls. It's definitely worth visiting here if you are in Innsbruck!"
  },
  {
    "country": "Greece",
    "location_1": "Acropolis of Athens",
    "rating_1": "4.8",
    "num_reviews_1": "132,036",
    "top_review_1": "The Acropolis in Athens is an incredible place filled with history and beauty. The ancient temples, especially the Parthenon, stand as symbols of Greek culture and human achievement. Walking among the ruins gives a strong sense of the past and the greatness of classical architecture. The views of the city from the top are breathtaking. It’s a peaceful and inspiring location that truly captures the spirit of ancient Greece. A visit here is a memorable and enriching experience.",
    "location_2": "Parthenon",
    "rating_2": "4.8",
    "num_reviews_2": "78,779",
    "top_review_2": "Parthenon temple in the centre of Acropolis, Athens, is one of the places you have to visit. Ancient ruins, throbbing with history, well-preserved parts of the temple and a beautiful view of Athens make this place truly magical and worth exploring. Especially beautiful on a sunny day",
    "location_3": "Meteora",
    "rating_3": "4.9",
    "num_reviews_3": "43,124",
    "top_review_3": "This is a must-visit. There just isn't anything else like it. The atmosphere, feeling of majesty and the experience of being there is just mind-blowing. I feel like my visit has broadened my experience of what could be in this world. The sense of adventure and excitement in visiting each monastery was excellent, and some of the frescoes which did not allow photography were very awesome.",
    "location_4": "Vikos Gorge",
    "rating_4": "4.9",
    "num_reviews_4": "6,582",
    "top_review_4": "If you want to see the gorge from the inside, it takes about 1.5 hours each way from Monodendri until you're really in the gorge, so you might as well do the entire 6 hours hike to Vikos village. Very steep decent to the gorge. It's beautiful both from inside and from the viewpoints",
    "location_5": "Archaeological Site of Olympia",
    "rating_5": "4.7",
    "num_reviews_5": "16,855",
    "top_review_5": "Great site. Unreal sizes of the Doric columns makes u feel in awe. Beautiful site, Spring nature at its best. Early March visit with excellent temperatures and not too many visitors."
  },
  {
    "country": "Malaysia",
    "location_1": "Taman Negara",
    "rating_1": "4.4",
    "num_reviews_1": "3,471",
    "top_review_1": "As an introverted homebody, my visit to Taman Negara was truly enlightening. I never imagined I would spend three hours on a boat to reach this destination. The canopy walk, soaring 40 meters above the ground, made me feel so high that I thought I might touch the heavens if I fell. While trekking through the jungle, I noticed several claw marks on the trees—were they from a bear or a tiger? How fascinating! At the same time, I wondered if it was safe for humans to be here at night, but I hesitated to ask. Regardless, I genuinely enjoyed the experience. A heartfelt thank you to the guide who shared so much valuable information about Taman Negara with us. For my Dad, I truly appreciate the unexpected surprise.",
    "location_2": "Batu Caves",
    "rating_2": "4.4",
    "num_reviews_2": "67,587",
    "top_review_2": "Beautiful area - 270 steps to the top of the stairs where there is a huge cave. There are multiple places to pray. There are tons of monkeys which are not very aggressive but may snatch loose items. Practice best judgement. There are vendors and restaurants at the base of the stairs for different cuisines including Indian and Malay. Make sure to wear sunscreen and bring water.",
    "location_3": "Menara Kuala Lumpur",
    "rating_3": "4.5",
    "num_reviews_3": "38,000",
    "top_review_3": "We went as it was getting dark and humbly suggest that this is a good time to go. The city lit up is spectacular, the views are simply mind blowing. There did appear to be coach trips that were disgorging lots of people in one go which then affected the speed of using the lifts however the staff are excellent at what they do, so it didn't seem a long wait. And so, so worth it. Genuinely one of the best views I've ever seen. And I've seen a few I can tell you.",
    "location_4": "Independence Square",
    "rating_4": "4.5",
    "num_reviews_4": "48,274",
    "top_review_4": "Also known as Dataran Merdeka, it's a large beautiful square in the middle of very scenic tall buildings. On the north end is the National Textiles Museum and a small fountain next to a very tall flagpole. The Sultan Abdul Samad Building is across the street. It is currently closed for renovation. To the east of the park is a river walk, a pleasant place to have a stroll with minimal traffic. There are many great spots for picture taking in the area. On the west side of the park there's a mom cat with 4 hungry kittens. Bring some packages of cat food, they'll appreciate it. Certainly worth a visit if you're in town.",
    "location_5": "Kellie's Castle",
    "rating_5": "4.2",
    "num_reviews_5": "11,093",
    "top_review_5": "This is my first time visiting this location, had been reading about it in documentaries and geography classes. Overall there's some part of the castle was preserved properly. It's very interesting how the castle was being built in the hearts of Batu Gajah, Kinta District and kudos to the officers for maintaining this tourist attraction."
  },
  {
    "country": "Portugal",
    "location_1": "Castelo de São Jorge",
    "rating_1": "4.4",
    "num_reviews_1": "92,184",
    "top_review_1": "Really fun experience. We went in the afternoon (at the end of March) and there was no wait to buy tickets and get inside. It was a memorable time exploring the grounds and walking around the castle. There were many peacocks throughout the castle which made it more magical. The views of Lisbon were incredible. Highly recommend",
    "location_2": "National Palace of Pena",
    "rating_2": "4.4",
    "num_reviews_2": "94,499",
    "top_review_2": "Absolutely amazing palace! Highly recommended to purchase ticket in advanced so you can avoid the long queue outside the entrance! Also if you just would like to check out the palace without entering the rooms, you can just buy a park pass and still able to go to the public places within the palace - you can still get a really good experience with the outstanding architecture and colours of the palace! The palace inside is worth checking out too, amazing details and interesting collection but just be aware even you have purchased the palace entry ticket into the room, you still have to be ready to queue for sometimes as there are quite a lot of people within the same timeslot! Bring water as well and prepare some uphill!",
    "location_3": "Belém Tower",
    "rating_3": "4.6",
    "num_reviews_3": "103,247",
    "top_review_3": "Very gorgeous place. Sunset was amazing. Wished could go inside. Not too many people around on Sunday afternoon and good spot to look at the bridge too.",
    "location_4": "Parque Nacional Peneda-Gerês",
    "rating_4": "4.8",
    "num_reviews_4": "24,966",
    "top_review_4": "Absolutely stunning nature place. Water falls, natural pools, and hikes for any level and skill. Friendly local people (woke up to cows surrounded my camper at 6am.) good wild camping spots. Due to changing weather had to leave earlier than planned but will be back. Mind the cows they were everywhere on the road.",
    "location_5": "Guimarães Castle",
    "rating_5": "4.5",
    "num_reviews_5": "32,055",
    "top_review_5": "It is a beautiful place, definitely worth visiting. The castle is very well preserved. The sights are wonderful. You can take a virtual experience while in the castle- I think it’s worth a while (maybe not high tech but definitely interesting). The town around the castle is magical, worth spending a day. Overall Guimaraes is maybe the most beautiful place in Portugal I’ve seen yet."
  },
  {
    "country": "Russia",
    "location_1": "St. Basil's Cathedral",
    "rating_1": "4.8",
    "num_reviews_1": "10,978",
    "top_review_1": "St. Basil’s Cathedral, officially known as the Cathedral of the Intercession of the Most Holy Theotokos on the Moat, is of course the iconic landmark in Moscow, located on Red Square. In countless movies, St. Basil’s immediately communicates the location as Moscow as well as the Capitol does for Washington, DC, the Colosseum for Rome and the Eiffel tower for Paris.",
    "location_2": "Peterhof",
    "rating_2": "4.8",
    "num_reviews_2": "79,976",
    "top_review_2": "Visiting Peterhof Palace near St. Petersburg was incredible! Known as the 'Russian Versailles,' it features stunning architecture and beautiful gardens. The Grand Cascade with its mesmerizing water jets is a highlight, and the coastal views of the Baltic Sea add to its charm. The opulent interiors showcase the grandeur of the Russian monarchy, making it a must-visit destination to experience Russia’s beauty and history!",
    "location_3": "The Moscow Kremlin",
    "rating_3": "4.8",
    "num_reviews_3": "54,403",
    "top_review_3": "A place full of history, the churches, and gardens are well worth the visit. Its impressive how this place is so well maintained. You can see the cannons left behind by Napoleon. You can also see iconic buildings from Russia's history although the tourist can really only see them from the outside, yet its still very worthwhile.",
    "location_4": "Red Square",
    "rating_4": "4.8",
    "num_reviews_4": "167,525",
    "top_review_4": "The Red Square stands as Moscow's most iconic historical site, encompassing a breathtaking array of landmarks and attractions. Surrounded by a beautiful mall and shops, this square boasts a rich tapestry of history, including the Kremlin, Lenin's grave, and the stunning Saint Basil's Cathedral. Each visit offers a profound journey through Russia's past, making it an essential destination for history enthusiasts and travelers alike.",
    "location_5": "State Hermitage Museum",
    "rating_5": "4.8",
    "num_reviews_5": "58,569",
    "top_review_5": "I hadn't booked tickets online and I was waiting at the queue for the tickets office for 2 hours on a Tuesday. Even the people with tickets were waiting on a queue, smaller though. Be prepared to wait! Maybe in bad weather too. The museum is packed with people and the map of the exhibitions in the palace is chaotic. The palace is chaotic. But it's beautiful and it has a great variety of things, from different times and different cultures/civilizations. You should definitely visit when in Saint Petersburg, but be prepared to wait in queue for a long time. Definitely arrive 30 minutes earlier when you have booked tickets."
  },
  {
    "country": "Canada",
    "location_1": "CN Tower",
    "rating_1": "4.6",
    "num_reviews_1": "77,634",
    "top_review_1": "I had a really good time visiting the CN Tower. Going all the way to the top along with the main deck was a memorable experience. The views were breathtaking, and it’s truly amazing to witness the marvel of engineering up close. One of the highlights for me was seeing the pendulum that shows the actual sway of the building—it was both fascinating and a bit surreal to realize the structure is constantly in gentle motion. Highly recommend visiting if you're in Toronto!",
    "location_2": "Parliament Hill",
    "rating_2": "4.7",
    "num_reviews_2": "36,967",
    "top_review_2": "I got to take two tours of Parliament—one of the Senate and other the House of Commons—and the experience was absolutely incredible! Each tour offered a unique perspective on Canada’s government, with stunning architecture, rich history, and fascinating insights into how the country is run. The level of detail and care put into the tours made it all the more engaging, and it was incredible to see these important spaces up close. Even though they are in temporary spaces because of construction in the central block, it is still a must-do if you’re visiting Ottawa and the best thing is they are free and all you have to do is reserve a spot from their website!",
    "location_3": "Journey Behind the Falls",
    "rating_3": "4.5",
    "num_reviews_3": "11,863",
    "top_review_3": "Absolutely breathtaking experience! The Journey Behind the Falls offers an incredible opportunity to see the majestic Niagara Falls up close and personal. The tunnels are well-maintained, and the observation decks provide stunning views of the falls from different angles. They provided ponchos for everyone. It's definitely worth the price of admission for anyone visiting Niagara Falls. Highly recommend",
    "location_4": "Little Canada",
    "rating_4": "4.9",
    "num_reviews_4": "2,734",
    "top_review_4": "The exhibits are amazing. My third time visiting since it first opened. Staff were very friendly and I got to speak to one of the artists that was very informative. Great way to enjoy Canada through all the details the artist put into each place. Gift shop prices were very reasonable and surprisingly affordable. Clean environment and I enjoyed the Maurice moose scavenger hunt.",
    "location_5": "Horseshoe Falls of Canada",
    "rating_5": "4.9",
    "num_reviews_5": "10,181",
    "top_review_5": "One of the best areas to watch the Niagara Falls and tale great photos. There is also a shopping area and plenty of parking across the street. Parking is a  bit expensive.  It gets very cold and Wendy during the winter months so bring plenty of layers to stay warm."
  },
  {
    "country": "Netherlands",
    "location_1": "Keukenhof",
    "rating_1": "4.7",
    "num_reviews_1": "62,560",
    "top_review_1": "Amazing location for floral lovers 🌷. A lot flowers you can also see in the indoor greenhouses, so even if the weather is not nice, there is still plenty to see. Best to go in the mid April when most of the tulips are blooming but it’s always better to check with locals before planning a trip there. Tickets can be easily bought online through their website.",
    "location_2": "Van Gogh Museum",
    "rating_2": "4.6",
    "num_reviews_2": "94,567",
    "top_review_2": "An unforgettable experience! The Van Gogh Museum offers a deep and beautifully curated journey through the life and work of one of the greatest artists in history. The collection is stunning, and the way it's presented gives amazing insight into Van Gogh’s evolution, struggles, and genius. The audio guide adds so much value. A must-visit in Amsterdam for art lovers and anyone curious about the man behind the masterpieces",
    "location_3": "Anne Frank House",
    "rating_3": "4.5",
    "num_reviews_3": "70,133",
    "top_review_3": "What can I say ! So much more than 5 stars. This is a must experience for all. The museum is set out perfectly. Recordings for all with easy access in each room. The planning of the journey through the museum to go into the house is perfect. There is no sign to say no talking, but people travelled through in silence, even children. There is a feeling of calm, sadness and respect from all. One of the most amazing expierences of  my life. I bought an excellent book with all the information and photos of the experience, a humbling experience. One I wanted to see for years and will never forget.... Thank you Otto Frank.",
    "location_4": "Binnenhof",
    "rating_4": "4.5",
    "num_reviews_4": "1,427",
    "top_review_4": "Beautiful hsitoric group of buildings where the Dutch government (parliament and senat) is having its official meetings. When we visited in August 2024 some buildings were being renovated and were closed for the public. We really enjoyed walking in the area full of Dutch history.",
    "location_5": "Vondelpark",
    "rating_5": "4.7",
    "num_reviews_5": "54,587",
    "top_review_5": "The most beautiful place in Amsterdam. There are many small ponds and incredibly beautiful views inside. It can be a bit too crowded on weekends. It is a very bad situation that there are no toilets. It is a very beautiful place where you can have great moments with a running track, many children's parks inside, benches with a perfect view."
  },
  {
    "country": "Vietnam",
    "location_1": "Imperial Citadel of Thang Long",
    "rating_1": "4.4",
    "num_reviews_1": "16,166",
    "top_review_1": "This place is huge and is probably one tourist site that is a must visit when in Hanoi. Lots of info about the history and culture of Hanoi and the actual war bunker used during the US air strikes is also on the site. You would probably need half a day or longer to see everything. If you’re making your own way there, don’t make the same mistake which i made thinking there is a main entrance on the east side as shown on Google maps. There was only one way in and out when I visited in December and it was on the west side of the site.",
    "location_2": "Cuc Phuong National Park",
    "rating_2": "4.4",
    "num_reviews_2": "3,845",
    "top_review_2": "If you get the chance to go I highly recommend renting a motor bike and going! You pay 60k dong and they let you drive about 20 km down a road into the jungle. The road was very quiet and there are a lot of hikes to do there. I’m nice you are comfortable with the road you can get some speed at times which if you are adrenaline junky like myself but you can also take your time. I would recommend getting a group of people interested in going and just get yourself there. You can also go to see some monkeys at the sanctuary and make a day of it. 10/10 would recommend",
    "location_3": "Lung Cu Flag Point",
    "rating_3": "4.6",
    "num_reviews_3": "7,876",
    "top_review_3": "839 steps up, 839 steps down equals sore muscles for a couple of days. But it's worth it. You can also take a Honda Om (Motorbike Taxi for 75% of the way up) It's the most Northern Point in Vietnam and the View is Spectacular. So if you in Dong Van, do yourself a favor and make the  short journey there, which in itself is a beautiful drive.",
    "location_4": "Bui Vien Walking Street",
    "rating_4": "4.3",
    "num_reviews_4": "20,254",
    "top_review_4": "This vibrant tourist attraction in Ho Chi Minh City is a lengthy street lined with an array of restaurants and bars, transformed into a dazzling spectacle every night through its mesmerizing illumination. As you stroll along, you might be surprised by the warm hospitality of locals, with some even offering you a complimentary drink or inviting you to take a seat. The street is abuzz with activity, featuring “sexy men and women dancers” that add to the lively ambiance, often accompanied by loud music that pulsates through the air. The nightlife here is truly unique, giving the impression that sleep is a distant concept in this area. It's an exhilarating experience that's definitely worth anticipating – the energy is electric, and the memories are waiting to be made.",
    "location_5": "Hang Sơn Đoòng",
    "rating_5": "4.6",
    "num_reviews_5": "1,003",
    "top_review_5": "It was so beautiful, my first experience here & really it was breath taking. Nature has its own beauty to show us very beautiful stuff. The lake, the mountain, it's soooo peaceful."
  },
  {
    "country": "India",
    "location_1": "India Gate",
    "rating_1": "4.6",
    "num_reviews_1": "280,212",
    "top_review_1": "India Gate in the evening, especially on a weekend, is a lively and vibrant experience. The iconic monument, beautifully lit up, stands tall amidst a bustling crowd of visitors, families, and photographers. The atmosphere is energetic, with people enjoying , taking pictures, and kids and families strolling along the lawns. While the crowd can be overwhelming, the overall experience is enjoyable, offering a perfect blend of history, patriotism, and leisure.",
    "location_2": "Taj Mahal",
    "rating_2": "4.6",
    "num_reviews_2": "241,252",
    "top_review_2": "An architectural wonder that lives up to all the hype! The intricate details on the walls and the peaceful vibe around the monument are unforgettable. It’s a perfect spot for photography, especially at sunset. Highly recommend hiring a guide to learn the fascinating story of this iconic place. A true gem of India!",
    "location_3": "Amber Palace",
    "rating_3": "4.6",
    "num_reviews_3": "165,194",
    "top_review_3": "Being one of the top reviewed places in Google, Amer Fort is truly an architectural marvel. To really appreciate its beauty one must hire a guide and enter the fort by 9AM as and when it opens for visitors. Post lunch the place gets swarmed by visitors, some nice, some not so nice. The palace requires more guards to oversee visitors at every level. We have to preserve this icon of Indian tourism",
    "location_4": "Hawa Mahal",
    "rating_4": "4.5",
    "num_reviews_4": "151,167",
    "top_review_4": "Hawa Mahal is an architectural marvel that never fails to impress! The intricate latticework and the unique facade with its hundreds of small windows create a stunning visual masterpiece, reflecting the rich cultural heritage of Jaipur. The structure's design not only offers beautiful views but also a cool, breezy ambiance that makes the area even more charming. Whether you're a history enthusiast, a photography lover, or simply exploring the city, Hawa Mahal is an absolute must-visit. It’s a true testament to the ingenuity and artistry of ancient Indian architecture. Highly recommended!",
    "location_5": "Gateway Of India Mumbai",
    "rating_5": "4.6",
    "num_reviews_5": "376,767",
    "top_review_5": "If you're looking for a place with a great view, the Gate Way Of India is a great option. It's located on the waterfront and offers stunning views of the Arabian Sea. It's also a popular spot for taking photos, so you're sure to get some great shots here."
  },
  {
    "country": "South Korea",
    "location_1": "N Seoul Tower",
    "rating_1": "4.5",
    "num_reviews_1": "62,394",
    "top_review_1": "I visited N Seoul Tower during my trip to Seoul, and it was definitely worth the trip. The tower offers some of the best panoramic views of the city, especially at night when the lights make everything look stunning. You can either hike up to the tower or take the cable car, but the walk up is pretty scenic and not too hard. Once at the top, the observation deck provides amazing views, and there’s also a nice area for photos. It’s a great spot for a peaceful escape from the city bustle and to take in the whole city from above. Definitely a must-visit if you’re in Seoul!",
    "location_2": "Nami Island",
    "rating_2": "4.4",
    "num_reviews_2": "36,456",
    "top_review_2": "My first time and I enjoyed it. Snowy winter day made it more beautiful. I think spring or autumn would be best time to visit. Thanks to snow, it felt more unique and special. If I come next time, I want to try different season and to stay in hotel!",
    "location_3": "Changdeokgung",
    "rating_3": "4.6",
    "num_reviews_3": "12,869",
    "top_review_3": "Changdeokgung Palace is one of the most impressive palaces in Seoul. It beautifully combines traditional architecture with a stunning garden landscape, creating a serene and majestic atmosphere. The absolute highlight was the secret garden, Huwon, a peaceful oasis filled with nature and historical charm. Since I visited on Culture Day, admission was free, making the experience even more special. A truly unforgettable place that should not be missed!",
    "location_4": "Namsangol Hanok Village",
    "rating_4": "4.3",
    "num_reviews_4": "9,775",
    "top_review_4": "Traditional Korean village that can be visited for free. A lot of old houses are perfectly preserved and is one of the rare places where we can see pieces of furniture and other indoor decorative elements. The garden is calm and offers many opportunities to wander. Excellent place to visit in Seoul.",
    "location_5": "Lotte World",
    "rating_5": "4.3",
    "num_reviews_5": "46,777",
    "top_review_5": "Great place to spend the day. It is perfect for kids. Don’t expect it to be very scary or extreme, it is more for the smaller kids to have fun. There are tough some attractions for adults as well like the French Revolution(a rollercoaster) and the big boat. There is plenty of options for food and a few time per day there are performances with costumes. For us it was too cold to experience the outside part but it also looked very fun."
  }
]